# Laboratorio: tratamiento de columnas

In [17]:
import pandas as pd
import numpy as np
import datetime as dt

In [30]:
bond = pd.read_csv("jamesbond.csv")
bond.head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

## Cambio de nombres en las columnas

In [19]:
bond.columns = ["Movie", "Year of release", "Actor", "Director", "Box Office", "Budget", "Bond Actor Salary"]
bond.head()

,Movie,Year of release,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [4]:
bond.rename(columns = {"Year of release" : "Release date", 
                       "Box Office" : "Revenue"}, 
            inplace = True)

bond.head()

,Movie,Release date,Actor,Director,Revenue,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

## Eliminaci√≥n de columnas

In [5]:
bond.drop(labels = ["Actor", "Revenue", "Budget"], axis = "columns", inplace = True)

In [6]:
del bond["Director"]

In [7]:
bond.head()

                   Movie  Release date  Bond Actor Salary
0                 Dr. No          1962                0.6
1  From Russia with Love          1963                1.6
2             Goldfinger          1964                3.2
3            Thunderball          1965                4.7
4          Casino Royale          1967                NaN

## Insertar valores en un dataset

In [20]:
bond.loc[1,"Actor"] = "Daniel Blanc"
bond.head()

,Movie,Year of release,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Daniel Blanc,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

## Obtener subsets

In [21]:
bond.sample(n = 4, axis = "rows")

,Movie,Year of release,Actor,Director,Box Office,Budget,Bond Actor Salary
8,Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
23,Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8.1
5,You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
16,The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2

In [23]:
bond.nlargest(n = 5, columns = "Box Office")

,Movie,Year of release,Actor,Director,Box Office,Budget,Bond Actor Salary
24,Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
25,Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,NaN
22,Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3

In [24]:
bond.nsmallest(n = 4, columns = "Box Office")

,Movie,Year of release,Actor,Director,Box Office,Budget,Bond Actor Salary
17,Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
15,A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
6,On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
16,The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2

## Apply

In [25]:
def pasar_a_millones(numero):
  return str(numero) + " millones."

In [26]:
pasar_a_millones(5)

'5 millones.'

In [27]:
columns = ["Box Office", "Budget", "Bond Actor Salary"]
for c in columns:
  bond[c] = bond[c].apply(pasar_a_millones)

In [32]:
bond.head()

                    Film  Year  ...          Budget Bond Actor Salary
0                 Dr. No  1962  ...   7.0 millones.     0.6 millones.
1  From Russia with Love  1963  ...  12.6 millones.     1.6 millones.
2             Goldfinger  1964  ...  18.6 millones.     3.2 millones.
3            Thunderball  1965  ...  41.9 millones.     4.7 millones.
4          Casino Royale  1967  ...  85.0 millones.     nan millones.

[5 rows x 7 columns]

In [28]:
bond.iloc[0]

Movie                         Dr. No
Year of release                 1962
Actor                   Sean Connery
Director               Terence Young
Box Office           448.8 millones.
Budget                 7.0 millones.
Bond Actor Salary      0.6 millones.
Name: 0, dtype: object

In [31]:
def buena_pelicula(fila):

  actor = fila[2]
  budget = fila[5]

  if actor == "Pierce Brosnan":
    return "The best"
  elif actor == "Roger Moore" and budget > 40:
    return "Ok"
  else:
    return "No idea"

bond.apply(buena_pelicula, axis = "columns")

C:\Users\cpiriz\AppData\Local\Temp\ipykernel_168\1459548368.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  actor = fila[2]
C:\Users\cpiriz\AppData\Local\Temp\ipykernel_168\1459548368.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  budget = fila[5]

0      No idea
1      No idea
2      No idea
3      No idea
4      No idea
5      No idea
6      No idea
7      No idea
8      No idea
9      No idea
10          Ok
11          Ok
12          Ok
13     No idea
14          Ok
15          Ok
16     No idea
17     No idea
18    The best
19    The best
20    The best
21    The best
22     No idea
23     No idea
24     No idea
25     No idea
dtype: object

In [32]:
juicios_pelis = bond.apply(buena_pelicula, axis = "columns")
bond.insert(0, # Lugar en donde inserto la columnas
            "juicio_pelicula", # Nombre de la columna nueva
            juicios_pelis) # Elementos que componen la nueva columna

C:\Users\cpiriz\AppData\Local\Temp\ipykernel_168\1459548368.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  actor = fila[2]
C:\Users\cpiriz\AppData\Local\Temp\ipykernel_168\1459548368.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  budget = fila[5]

In [41]:
bond.query("juicio_pelicula =='Ok'").head(15)

,juicio_pelicula,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
10,Ok,The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,NaN
11,Ok,Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN
12,Ok,For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
14,Ok,Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8
15,Ok,A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1

In [42]:
bond["Budget en d√≥lares"] = bond["Budget"] * 46
bond.head()

  juicio_pelicula                   Film  ...  Bond Actor Salary Budget en d√≥lares
0         No idea                 Dr. No  ...                0.6             322.0
1         No idea  From Russia with Love  ...                1.6             579.6
2         No idea             Goldfinger  ...                3.2             855.6
3         No idea            Thunderball  ...                4.7            1927.4
4         No idea          Casino Royale  ...                NaN            3910.0

[5 rows x 9 columns]